app/views/client/_index.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`token` = '0b2b545c-022c-46c0-aab9-33f5303dd111' LIMIT 1
---
        <div class="col-lg-12">
            <h1 class="page-header" align="center" style="font-size: 3.5em; margin-top: 20px"><%= User.find_by(token: session[:userToken]).name %></h1>