app/controllers/signin_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`user` = 'a@a.com' LIMIT 1
UPDATE `users` SET `token` = 'ded09516-b08f-4c23-bb53-cb9d499f634e', `updated_at` = '2017-08-27 20:33:26' WHERE `users`.`id` = 1
---
  def login
    puts params
    puts params[:email]
    puts params[:password]

    @user = User.find_by(user: params[:email])
    puts @user
    if @user != nil
      if @user.password == params[:password]
        @user.token = generate_token
        if @user.save!